In [1]:
import pandas as pd

In [2]:
employee = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Joe', 'Henry', 'Sam', 'Max'],
    'salary': [70000, 80000, 60000, 90000],
    'managerId': [3, 4, None, None]
})

In [7]:
employee

   id   name  salary  managerId
0   1    Joe   70000        3.0
1   2  Henry   80000        4.0
2   3    Sam   60000        NaN
3   4    Max   90000        NaN

In [5]:
df = employee.merge(employee, how= 'inner', left_on= 'managerId', right_on= 'id', suffixes= ('_e', '_m'))

In [9]:
df[df['salary_e'] > df['salary_m']][['name_e']].rename(columns = {'name_e': 'Employee'})

  Employee
0      Joe